espressif/qemu/hw/usb/esp32s3_usb_otg.c
/*
 * ESP32-S3 USB-OTG (Synopsys DWC2, device mode) emulation
 *
 * See include/hw/usb/esp32s3_usb_otg.h for the design overview.
 *
 * Implemented register semantics follow the Synopsys DWC2 databook as
 * driven by TinyUSB's dcd_dwc2 driver (slave/FIFO mode, device role):
 *  - global/core regs (GOTGCTL..GDFIFOCFG), GSNPSID/GHWCFG1-4 as the
 *    ESP32-S3 FS-only, slave-only core reports them
 *  - device regs (DCFG/DCTL/DSTS), endpoint interrupt plumbing
 *    (DIEPMSK/DOEPMSK/DAINT/DAINTMSK/DIEPEMPMSK)
 *  - IN/OUT endpoint register blocks (DxEPCTL/INT/TSIZ/DTXFSTS)
 *  - word-granular DFIFO windows (4 bytes per 32-bit access); DFIFO0
 *    writes feed the EP0 IN Tx FIFO, DFIFO0 reads pop the shared Rx FIFO
 *  - GRXSTSP status queue driving the RXFLVL interrupt
 *
 * The virtual host raises USBRST+ENUMDNE after the guest connects, then
 * runs the standard enumeration sequence, parsing the guest's descriptors
 * (device descriptor string indexes, config wTotalLength). After
 * SET_CONFIGURATION it exchanges bulk data with the chardev: guest IN
 * packets are written to the chardev; chardev bytes are delivered as OUT
 * packets (one <=MPS packet per arming, plus a ZLP once the pending data
 * drains, so guest reads complete per host write boundary).
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "qemu/error-report.h"
#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "hw/qdev-properties-system.h"
#include "hw/usb/esp32s3_usb_otg.h"
#include "hw/misc/esp32s3_reg.h"
#include "chardev/char-fe.h"
#include "sysemu/sysemu.h"

#define DEBUG_DWC2 1

#ifdef DEBUG_DWC2
#define DWC2_DEBUG(...) qemu_log(__VA_ARGS__)
#else
#define DWC2_DEBUG(...) do { } while (0)
#endif

/* Register offsets (device-mode subset) */
#define R_GOTGCTL      0x000
#define R_GOTGINT      0x004
#define R_GAHBCFG      0x008
#define R_GUSBCFG      0x00C
#define R_GRSTCTL      0x010
#define R_GINTSTS      0x014
#define R_GINTMSK      0x018
#define R_GRXSTSR      0x01C
#define R_GRXSTSP      0x020
#define R_GRXFSIZ      0x024
#define R_DIEPTXF0     0x028
#define R_GNPTXSTS     0x02C
#define R_GGPIO        0x038
#define R_GUID         0x03C
#define R_GSNPSID      0x040
#define R_GHWCFG1      0x044
#define R_GHWCFG2      0x048
#define R_GHWCFG3      0x04C
#define R_GHWCFG4      0x050
#define R_GDFIFOCFG    0x05C
#define R_DIEPTXF0_N   0x104     /* DIEPTXFn: n = 0..14 -> IN EP n+1 */
#define R_DIEPTXF_LAST 0x13C

#define R_DCFG         0x800
#define R_DCTL         0x804
#define R_DSTS         0x808
#define R_DIEPMSK      0x810
#define R_DOEPMSK      0x814
#define R_DAINT        0x818
#define R_DAINTMSK     0x81C
#define R_DIEPEMPMSK   0x834
#define R_PCGCCTL      0xE00

#define R_EPIN_BASE    0x900    /* IN EPn block: 0x900 + 0x20*n */
#define R_EPOUT_BASE   0xB00    /* OUT EPn block: 0xB00 + 0x20*n */
#define EP_OFF_CTL     0x00
#define EP_OFF_INT     0x08
#define EP_OFF_TSIZ    0x10
#define EP_OFF_DMA     0x14
#define EP_OFF_DTXFSTS 0x18
#define EP_BLK_SIZE    0x20

#define R_DFIFO0       0x1000
#define R_DFIFO_STRIDE 0x1000
#define R_DFIFO_END    0x10000

/* Bit definitions */
#define GINT_B_SOF         (1u << 3)
#define GINT_B_RXFLVL      (1u << 4)
#define GINT_B_GOUTNAKEFF  (1u << 7)
#define GINT_B_USBRST      (1u << 12)
#define GINT_B_ENUMDNE     (1u << 13)
#define GINT_B_IEPINT      (1u << 18)
#define GINT_B_OEPINT      (1u << 19)

/* GRXSTSP packet status values */
#define PKTSTS_RX_DATA     2
#define PKTSTS_RX_COMPLETE 3
#define PKTSTS_SETUP_DONE  4
#define PKTSTS_SETUP_RX    6

/* DEPCTL bits */
#define EPCTL_MPSIZ_MASK   0x7FFu
#define EPCTL_USBAEP       (1u << 15)
#define EPCTL_STALL        (1u << 21)
#define EPCTL_CNAK         (1u << 26)
#define EPCTL_SNAK         (1u << 27)
#define EPCTL_EPDIS        (1u << 30)
#define EPCTL_EPENA        (1u << 31)

/* DIEPINT bits */
#define DIEPINT_XFRC       (1u << 0)
#define DIEPINT_EPDISD     (1u << 1)
#define DIEPINT_TXFE       (1u << 7)

/* DOEPINT bits */
#define DOEPINT_XFRC       (1u << 0)
#define DOEPINT_EPDISD     (1u << 1)
#define DOEPINT_SETUP      (1u << 3)

/* GRSTCTL bits */
#define GRSTCTL_CSRST      (1u << 0)
#define GRSTCTL_RXFFLSH    (1u << 4)
#define GRSTCTL_TXFFLSH    (1u << 5)
#define GRSTCTL_TXFNUM_SHIFT 6
#define GRSTCTL_TXFNUM_MASK   (0x1Fu << GRSTCTL_TXFNUM_SHIFT)
#define GRSTCTL_AHBIDL     (1u << 31)

/* DCTL bits */
#define DCTL_SDIS          (1u << 1)
#define DCTL_SGONAK        (1u << 9)
#define DCTL_CGONAK        (1u << 10)

/* tsiz fields */
#define TSIZ_XFER_SIZE_MASK 0x7FFFFu

/* GRXSTSP entry composition */
#define GRXSTSP_ENTRY(epnum, bcnt, pktsts) \
    (((epnum) & 0xFu) | (((bcnt) & 0x7FFu) << 4) | (((pktsts) & 0xFu) << 17))

/* Identity values reported by the emulated core.
 * GSNPSID: DWC2 OTG family, rev 2.80a (< 3.00a so the DMA setup path is
 * never taken, != 3.10a so the RXFIFO quirk path is never taken, < 4.20a
 * so CSRST is expected to be self-clearing, which this model implements).
 * GHWCFG2: slave-only arch, no HS PHY, dedicated FS PHY, 6 device
 * endpoints (+EP0), dynamic FIFO sizing.
 * GHWCFG3: 19-bit xfer size counter, 10-bit packet size counter,
 * 256-word DFIFO depth.
 * GHWCFG4: dedicated tx FIFOs, 6 IN endpoints incl. EP0.
 */
#define GSNPSID_VAL  0x4F54280Au
#define GHWCFG1_VAL  0x00000556u /* EP0 bidi, EP1-5 IN, EP6 OUT */
#define GHWCFG2_VAL  0x00081900u
#define GHWCFG3_VAL  0x01000068u
#define GHWCFG4_VAL  0x1A000000u

#define EP0_MPS           64

/* Virtual host timing (virtual-time milliseconds). The step timeout is
 * generous: a real host waits seconds for control responses. */
#define VHOST_RESET_DELAY_MS   5
#define VHOST_ENUM_DELAY_MS    5
#define VHOST_STEP_TIMEOUT_MS  20000
#define VHOST_FRAME_PERIOD_MS  1

/* Largest OUT packet delivered per arming (FS bulk MPS) */
#define OUT_PACKET_MAX 64

static inline uint32_t tsiz_xfer_size(uint32_t tsiz)
{
    return tsiz & TSIZ_XFER_SIZE_MASK;
}

static inline uint32_t dep_mps(uint32_t ctl, unsigned epnum)
{
    if (epnum == 0) {
        /* EP0 MPSIZ is a 2-bit encoding at bits [21:22]: 0=64 1=32 2=16 3=8 */
        switch ((ctl >> 21) & 0x3u) {
        case 0: return 64;
        case 1: return 32;
        case 2: return 16;
        default: return 8;
        }
    }
    return ctl & EPCTL_MPSIZ_MASK;
}

/* Derived DAINT: per-endpoint interrupt summary (IN low half, OUT high). */
static uint32_t dwc2_daint_derived(Esp32s3UsbOtgState *s)
{
    uint32_t v = 0;
    unsigned i;

    for (i = 0; i < ESP32S3_USB_EP_COUNT; i++) {
        /*
         * TXFE is gated by the per-endpoint DIEPEMPMSK bit, not DIEPMSK
         * (real Synopsys DWC2 semantics: DIEPMSK's own TXFE-adjacent bit
         * is a different, common-interrupt-only gate; drivers that ask
         * for a one-shot "FIFO empty" notification around each transfer
         * use DIEPEMPMSK per endpoint instead). Without this, a TXFE
         * assert never reaches DAINT/GINTSTS.IEPINT for a driver that
         * only ever unmasks it via DIEPEMPMSK — the transfer stays armed
         * with no interrupt ever telling the driver to push data.
         */
        if (s->epin[i].int_st & s->diepmsk & ~DIEPINT_TXFE) {
            v |= 1u << i;
        }
        if ((s->epin[i].int_st & DIEPINT_TXFE) && (s->diepempmsk & (1u << i))) {
            v |= 1u << i;
        }
        if (s->epout[i].int_st & s->doepmsk) {
            v |= 1u << (16 + i);
        }
    }
    return v;
}

static uint32_t dwc2_gintsts_effective(Esp32s3UsbOtgState *s)
{
    uint32_t v = s->gintsts;
    uint32_t daint = dwc2_daint_derived(s);

