espressif/qemu/hw/usb/esp32s3_usb_otg.c
    if (s->rxstsp_head != s->rxstsp_tail) {
        v |= GINT_B_RXFLVL;
    }
    if (daint & s->daintmsk & 0xFFFFu) {
        v |= GINT_B_IEPINT;
    }
    if (daint & s->daintmsk & 0xFFFF0000u) {
        v |= GINT_B_OEPINT;
    }
    return v;
}

static void dwc2_update_irq(Esp32s3UsbOtgState *s)
{
    bool level = ((dwc2_gintsts_effective(s) & s->gintmsk) != 0)
                  && (s->gahbcfg & 1u); /* GAHBCFG.GINT */
    qemu_set_irq(s->irq, level);
}

/* Chardev data path */
static void dwc2_ch_flush(Esp32s3UsbOtgState *s);
static void dwc2_out_pump(Esp32s3UsbOtgState *s);

static gboolean dwc2_ch_flush_cb(void *do_not_use, GIOCondition cond, void *opaque)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(opaque);

    (void) do_not_use;
    (void) cond;
    s->tx_watch = 0;
    dwc2_ch_flush(s);
    return G_SOURCE_REMOVE;
}

static void dwc2_ch_flush(Esp32s3UsbOtgState *s)
{
    while (!fifo8_is_empty(&s->tx_ch_fifo)) {
        uint32_t navail = 0;
        const uint8_t *buf = fifo8_peek_bufptr(&s->tx_ch_fifo, fifo8_num_used(&s->tx_ch_fifo),
                                                &navail);
        int r = qemu_chr_fe_write(&s->chr, buf, navail);

        if (r <= 0) {
            if (!s->tx_watch) {
                s->tx_watch = qemu_chr_fe_add_watch(&s->chr, G_IO_OUT | G_IO_HUP,
                                                    dwc2_ch_flush_cb, s);
            }
            break;
        }
        fifo8_drop(&s->tx_ch_fifo, r);
        if ((uint32_t)r < navail) {
            break;
        }
    }
}

static int dwc2_ch_can_receive(void *opaque)
{
    return 4096;
}

static void dwc2_ch_receive(void *opaque, const uint8_t *buf, int size)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(opaque);

    fifo8_push_all(&s->rx_pending, buf, size);
    /* an armed OUT endpoint may be waiting for exactly this data */
    dwc2_out_pump(s);
}

static void dwc2_ch_event(void *opaque, QEMUChrEvent event)
{
}

/* GRXSTSP status queue (circular, one 32-bit word per entry) */
static void dwc2_rxstsp_push(Esp32s3UsbOtgState *s, unsigned epnum,
                             unsigned bcnt, unsigned pktsts)
{
    uint32_t next = (s->rxstsp_head + 1) % ESP32S3_USB_RXSTSP_QLEN;

    if (next == s->rxstsp_tail) {
        qemu_log_mask(LOG_GUEST_ERROR, "dwc2: GRXSTSP queue overflow\n");
        return;
    }
    s->rxstsp_q[s->rxstsp_head] = GRXSTSP_ENTRY(epnum, bcnt, pktsts);
    s->rxstsp_head = next;
}

static uint32_t dwc2_rxstsp_peek(Esp32s3UsbOtgState *s)
{
    if (s->rxstsp_head == s->rxstsp_tail) {
        return 0;
    }
    return s->rxstsp_q[s->rxstsp_tail];
}

static void dwc2_rxstsp_pop(Esp32s3UsbOtgState *s)
{
    if (s->rxstsp_head != s->rxstsp_tail) {
        s->rxstsp_tail = (s->rxstsp_tail + 1) % ESP32S3_USB_RXSTSP_QLEN;
    }
}

/* Word-aligned push into the shared RX data FIFO (reads pop 4 bytes). */
static void dwc2_rx_fifo_push(Esp32s3UsbOtgState *s, const uint8_t *data, unsigned len)
{
    unsigned padded = (len + 3u) & ~3u;

    fifo8_push_all(&s->grx_fifo, data, len);
    while (len < padded) {
        fifo8_push(&s->grx_fifo, 0);
        len++;
    }
}

static uint32_t dwc2_rx_fifo_pop_word(Esp32s3UsbOtgState *s)
{
    uint32_t v = 0;
    unsigned i;

    for (i = 0; i < 4; i++) {
        if (fifo8_is_empty(&s->grx_fifo)) {
            break;
        }
        v |= (uint32_t)fifo8_pop(&s->grx_fifo) << (8 * i);
    }
    return v;
}

/*
 * Move data from rx_pending into armed OUT endpoints. A packet (<= MPS)
 * is delivered per iteration; a short packet or an exhausted transfer
 * size completes it (RX_COMPLETE + DOEPINT.XFRC). When pending data
 * drains after a full packet while the transfer wants more, a ZLP is
 * delivered so the guest read completes at the host write boundary.
 */
static void dwc2_out_pump(Esp32s3UsbOtgState *s)
{
    unsigned ep;

    for (ep = 1; ep < ESP32S3_USB_EP_COUNT; ep++) {
        uint32_t ctl = s->epout[ep].ctl;
        bool delivered_any = false;
        bool complete = false;

        if (!(ctl & EPCTL_EPENA) || (ctl & EPCTL_STALL)) {
            continue;
        }

        while (!fifo8_is_empty(&s->rx_pending)) {
            uint32_t remain = tsiz_xfer_size(s->epout[ep].tsiz);
            uint32_t mps = dep_mps(ctl, ep);
            uint32_t navail = 0;
            uint32_t n, chunk;
            const uint8_t *src;

            n = MIN(remain, mps);
            if (n == 0) {
                break;
            }
            if (fifo8_num_used(&s->rx_pending) < n) {
                n = fifo8_num_used(&s->rx_pending);
            }

            src = fifo8_peek_bufptr(&s->rx_pending, n, &navail);
            chunk = MIN(n, navail);
            /* RX_DATA status word first: the driver pops it, then reads
             * exactly `bcnt` bytes off the shared RX data FIFO */
            dwc2_rxstsp_push(s, ep, chunk, PKTSTS_RX_DATA);
            dwc2_rx_fifo_push(s, src, chunk);
            fifo8_drop(&s->rx_pending, chunk);

            /* hardware decrements DOEPTSIZ as bytes are received */
            s->epout[ep].tsiz -= chunk;
            delivered_any = true;
            DWC2_DEBUG("dwc2: OUT ep%u %u bytes (remain %u)\n",
                       ep, chunk, tsiz_xfer_size(s->epout[ep].tsiz));

            if (chunk < mps || tsiz_xfer_size(s->epout[ep].tsiz) == 0) {
                complete = true;
                break;
            }
        }

        if (complete) {
            dwc2_rxstsp_push(s, ep, 0, PKTSTS_RX_COMPLETE);
            s->epout[ep].int_st |= DOEPINT_XFRC;
            s->epout[ep].ctl &= ~EPCTL_EPENA;
            dwc2_update_irq(s);
        } else if (delivered_any) {
            /* drained after full packet(s): deliver a ZLP to complete */
            dwc2_rxstsp_push(s, ep, 0, PKTSTS_RX_DATA);
            dwc2_rxstsp_push(s, ep, 0, PKTSTS_RX_COMPLETE);
            s->epout[ep].int_st |= DOEPINT_XFRC;
            s->epout[ep].ctl &= ~EPCTL_EPENA;
            dwc2_update_irq(s);
        }
    }
}

/* Virtual host: enumeration + control transfers */
/* Build the SETUP packet for `seq`; returns NULL when enumeration ends. */
static const uint8_t *vhost_make_setup(Esp32s3UsbOtgState *s, unsigned seq)
{
    uint8_t *p = s->vhost_setup;
    unsigned idx;

    memset(p, 0, 8);
    switch (seq) {
    case 0: /* GET_DESCRIPTOR device, 64 */
        p[0] = 0x80; p[1] = 0x06; p[3] = 0x01;
        p[6] = 64;
        return p;
    case 1: /* SET_ADDRESS 1 */
        p[1] = 0x05; p[2] = 0x01;
        return p;
    case 2: /* GET_DESCRIPTOR device, 18 */
        p[0] = 0x80; p[1] = 0x06; p[3] = 0x01;
        p[6] = 18;
        return p;
    case 3: /* GET_DESCRIPTOR config, 9 */
        p[0] = 0x80; p[1] = 0x06; p[3] = 0x02;
        p[6] = 9;
        return p;
    case 4: /* GET_DESCRIPTOR config, wTotalLength */
        if (s->vhost_cfg_total == 0) {
            return NULL;
        }
        p[0] = 0x80; p[1] = 0x06; p[3] = 0x02;
        p[6] = s->vhost_cfg_total & 0xFF;
        p[7] = s->vhost_cfg_total >> 8;
        return p;
    case 5: /* GET_DESCRIPTOR string 0 */
        p[0] = 0x80; p[1] = 0x06; p[3] = 0x03;
        p[4] = 0x09; p[5] = 0x04; /* langid 0x0409 */
        p[6] = 255;
        return p;
    case 6: /* GET_DESCRIPTOR iManufacturer */
        idx = s->vhost_dev_iman;
        break;
    case 7: /* GET_DESCRIPTOR iProduct */
        idx = s->vhost_dev_iprod;
        break;
    case 8: /* GET_DESCRIPTOR iSerialNumber */
        idx = s->vhost_dev_iser;
        break;
    case 9: /* SET_CONFIGURATION 1 */
        p[1] = 0x09; p[2] = 0x01;
        return p;
    default:
        return NULL;
    }

    if (idx == 0) {
        /* no such string: skip to the next sequence step */
        s->vhost_seq = seq + 1;
        return vhost_make_setup(s, s->vhost_seq);
    }
    p[0] = 0x80; p[1] = 0x06; p[2] = idx; p[3] = 0x03;
    p[4] = 0x09; p[5] = 0x04;
    p[6] = 255;
    return p;
}

static void vhost_send_setup(Esp32s3UsbOtgState *s)
{
    const uint8_t *setup;

    setup = vhost_make_setup(s, s->vhost_seq);
    if (setup == NULL) {
        s->vhost = VHOST_CONFIGURED;
        DWC2_DEBUG("dwc2: vhost: configured\n");
        return;
    }

    /* SETUP_RX status word + 8 data bytes, then SETUP_DONE */
    dwc2_rxstsp_push(s, 0, 8, PKTSTS_SETUP_RX);
    fifo8_push_all(&s->grx_fifo, setup, 8);
    dwc2_rxstsp_push(s, 0, 0, PKTSTS_SETUP_DONE);
    s->epout[0].int_st |= DOEPINT_SETUP;

    s->vhost_wlength = setup[6] | (setup[7] << 8);
    s->vhost_in_count = 0;

    if (s->vhost_wlength == 0) {
        /* no data stage: guest answers with a status IN (ZLP) */
        s->vhost_phase = VPH_STATUS_IN_WAIT;
    } else if (setup[0] & 0x80) {
        s->vhost_phase = VPH_DATA_IN;
    } else {
        s->vhost_phase = VPH_DATA_OUT;
    }

    DWC2_DEBUG("dwc2: vhost: SETUP seq=%u %02x %02x wLength=%u\n",
               s->vhost_seq, setup[0], setup[1], s->vhost_wlength);
    dwc2_update_irq(s);
}

