espressif/qemu/hw/usb/esp32s3_usb_otg.c
/* A control transfer finished; advance to the next enumeration step. */
static void vhost_ctrl_done(Esp32s3UsbOtgState *s)
{
    s->vhost_seq++;
    s->vhost_stalled = false;
    s->vhost_phase = VPH_SETUP_SENT;
    s->vhost_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL)
                           + (int64_t)VHOST_STEP_TIMEOUT_MS * SCALE_MS;
    vhost_send_setup(s);
}

/* Guest pushed `n` bytes of IN data on EP0. */
static void vhost_on_ep0_in(Esp32s3UsbOtgState *s, unsigned n)
{
    if (s->vhost != VHOST_CTRL) {
        return;
    }

    if (s->vhost_phase == VPH_STATUS_IN_WAIT) {
        /* zero-length status IN completing a control write (incl. a
         * no-data-stage write like SET_ADDRESS / SET_CONFIGURATION) */
        DWC2_DEBUG("dwc2: vhost: control write complete\n");
        vhost_ctrl_done(s);
        return;
    }

    if (s->vhost_phase == VPH_SETUP_SENT || s->vhost_phase == VPH_DATA_IN) {
        s->vhost_phase = VPH_DATA_IN;
        /* data stage ends on a short packet or when wLength is reached */
        if (n < EP0_MPS || s->vhost_in_count >= s->vhost_wlength) {
            s->vhost_phase = VPH_STATUS_OUT_WAIT;
            DWC2_DEBUG("dwc2: vhost: data-in done (%u bytes)\n",
                       s->vhost_in_count);
        }
    }
}

/* Guest wrote EP0 OUT regs: data-stage arming or status-phase arming. */
static void vhost_on_ep0_out(Esp32s3UsbOtgState *s)
{
    if (s->vhost != VHOST_CTRL) {
        return;
    }

    if (tsiz_xfer_size(s->epout[0].tsiz) == 0) {
        if (s->vhost_phase == VPH_STATUS_OUT_WAIT) {
            /* status ZLP for a control read: deliver + complete */
            DWC2_DEBUG("dwc2: vhost: control read complete\n");
            dwc2_rxstsp_push(s, 0, 0, PKTSTS_RX_DATA);
            dwc2_rxstsp_push(s, 0, 0, PKTSTS_RX_COMPLETE);
            s->epout[0].int_st |= DOEPINT_XFRC;
            dwc2_update_irq(s);
            vhost_ctrl_done(s);
        }
        return;
    }

    if (s->vhost_phase == VPH_DATA_OUT) {
        /* data stage of a control write: deliver zeros (no real payload) */
        uint32_t n = tsiz_xfer_size(s->epout[0].tsiz);
        uint8_t zeros[64];

        while (n > 0) {
            uint32_t pkt = MIN(n, EP0_MPS);
            memset(zeros, 0, pkt);
            dwc2_rx_fifo_push(s, zeros, pkt);
            dwc2_rxstsp_push(s, 0, pkt, PKTSTS_RX_DATA);
            s->epout[0].tsiz -= pkt;
            n -= pkt;
        }
        dwc2_rxstsp_push(s, 0, 0, PKTSTS_RX_COMPLETE);
        s->epout[0].int_st |= DOEPINT_XFRC;
        s->vhost_phase = VPH_STATUS_IN_WAIT;
        dwc2_update_irq(s);
    }
}

/* Parse captured data-in bytes for enumeration bookkeeping. */
static void vhost_capture_in(Esp32s3UsbOtgState *s)
{
    if (s->vhost != VHOST_CTRL || s->vhost_in_count == 0) {
        return;
    }

    switch (s->vhost_seq) {
    case 2: /* device descriptor */
        if (s->vhost_in_count >= 17) {
            s->vhost_dev_iman = s->vhost_in_buf[14];
            s->vhost_dev_iprod = s->vhost_in_buf[15];
            s->vhost_dev_iser = s->vhost_in_buf[16];
        }
        break;
    case 3: /* 9-byte config descriptor prefix */
        if (s->vhost_in_count >= 4) {
            s->vhost_cfg_total = s->vhost_in_buf[2] | (s->vhost_in_buf[3] << 8);
        }
        break;
    default:
        break;
    }
}

/* ------------------------------------------------------------------ */
/* Virtual host state machine                                          */
/* ------------------------------------------------------------------ */

static void vhost_process(Esp32s3UsbOtgState *s)
{
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);

    switch (s->vhost) {
    case VHOST_DISCONNECTED:
        break;

    case VHOST_WAIT_RESET:
        if (now >= s->vhost_deadline_ns) {
            DWC2_DEBUG("dwc2: vhost: bus reset\n");
            /* USBRST + ENUMDNE together: dcd_int_handler processes both
             * in one pass (reset handling first, then enumeration done). */
            s->gintsts |= GINT_B_USBRST | GINT_B_ENUMDNE;
            s->vhost = VHOST_WAIT_ENUM;
            s->vhost_deadline_ns = now + (int64_t)VHOST_ENUM_DELAY_MS * SCALE_MS;
            dwc2_update_irq(s);
        }
        break;

    case VHOST_WAIT_ENUM:
        if (now >= s->vhost_deadline_ns) {
            s->vhost = VHOST_CTRL;
            s->vhost_seq = 0;
            s->vhost_phase = VPH_SETUP_SENT;
            s->vhost_deadline_ns = now + (int64_t)VHOST_STEP_TIMEOUT_MS * SCALE_MS;
            vhost_send_setup(s);
        }
        break;

    case VHOST_CTRL:
        /* timeout: the guest stalled or never answered; move on */
        if (now >= s->vhost_deadline_ns) {
            DWC2_DEBUG("dwc2: vhost: control step timeout, advancing\n");
            vhost_ctrl_done(s);
        }
        break;

    case VHOST_CONFIGURED:
        break;
    }
}

static void vhost_connect(Esp32s3UsbOtgState *s)
{
    if (s->vhost != VHOST_DISCONNECTED) {
        return;
    }
    s->vhost = VHOST_WAIT_RESET;
    s->vhost_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL)
                           + (int64_t)VHOST_RESET_DELAY_MS * SCALE_MS;
}

static void vhost_disconnect(Esp32s3UsbOtgState *s)
{
    s->vhost = VHOST_DISCONNECTED;
    s->gintsts &= ~(GINT_B_USBRST | GINT_B_ENUMDNE);
}

static void dwc2_frame_tick(void *opaque)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(opaque);
    static unsigned dump_div;

    timer_mod(&s->frame_timer,
              qemu_clock_get_ms(QEMU_CLOCK_VIRTUAL) + VHOST_FRAME_PERIOD_MS);

    if (s->gintmsk & GINT_B_SOF) {
        s->gintsts |= GINT_B_SOF;
        dwc2_update_irq(s);
    }

    if (++dump_div >= 500) {
        dump_div = 0;
        DWC2_DEBUG("dwc2: regs vhost=%d gintsts=%08x gintmsk=%08x gahbcfg=%08x "
                   "daintmsk=%08x diepmsk=%08x doepmsk=%08x diepempmsk=%08x dctl=%08x\n",
                   s->vhost, dwc2_gintsts_effective(s), s->gintmsk, s->gahbcfg,
                   s->daintmsk, s->diepmsk, s->doepmsk, s->diepempmsk, s->dctl);
    }

    vhost_process(s);
}

/* IN (guest -> host) FIFO handling */
/* Guest pushed 4 bytes (one FIFO access) into IN FIFO `ep`. */
static void dwc2_in_fifo_write(Esp32s3UsbOtgState *s, unsigned ep, uint32_t value)
{
    uint8_t b[4];
    uint32_t left = s->epin[ep].xfer_left;
    unsigned real;
    unsigned captured = 0;

    if (left == 0) {
        return; /* transfer not armed; drop */
    }

    b[0] = value & 0xFF;
    b[1] = (value >> 8) & 0xFF;
    b[2] = (value >> 16) & 0xFF;
    b[3] = (value >> 24) & 0xFF;

    real = MIN(4u, left);
    fifo8_push_all(&s->epin[ep].data, b, real);
    s->epin[ep].xfer_left -= real;
    /* hardware decrements DIEPTSIZ as bytes are pushed */
    s->epin[ep].tsiz -= real;

