espressif/qemu/hw/usb/esp32s3_usb_otg.c
    /*
     * Transmit whatever is queued as soon as the driver finishes pushing
     * a packet. The driver only ever writes whole packets (it checks
     * DTXFSTS free space for the full packet before pushing), so a
     * non-empty FIFO after a burst with xfer_left > 0 is exactly one
     * complete packet that a real core would put on the wire
     * immediately; draining it lets the driver push the next packet via
     * TXFE. Holding data until xfer_left == 0 deadlocks multi-packet
     * transfers (the FIFO fills and the driver can never continue).
     */
    while (!fifo8_is_empty(&s->epin[ep].data)) {
        uint32_t navail = 0;
        const uint8_t *src = fifo8_peek_bufptr(&s->epin[ep].data,
                                               fifo8_num_used(&s->epin[ep].data),
                                               &navail);
        DWC2_DEBUG("dwc2: IN ep%u %u bytes\n", ep, navail);
        fifo8_push_all(&s->tx_ch_fifo, src, navail);
        fifo8_drop(&s->epin[ep].data, navail);
        if (ep == 0 && s->vhost_in_count < sizeof(s->vhost_in_buf)) {
            unsigned cap = sizeof(s->vhost_in_buf) - s->vhost_in_count;
            unsigned cpy = MIN((unsigned)navail, cap);

            memcpy(&s->vhost_in_buf[s->vhost_in_count], src, cpy);
            s->vhost_in_count += cpy;
        }
        captured += navail;
    }
    dwc2_ch_flush(s);

    if (s->epin[ep].xfer_left == 0) {
        /* whole transfer is on the wire */
        s->epin[ep].int_st |= DIEPINT_XFRC;
        s->epin[ep].ctl &= ~EPCTL_EPENA;
        dwc2_update_irq(s);

        if (ep == 0) {
            vhost_capture_in(s);
            vhost_on_ep0_in(s, captured);
        }
    } else {
        /* more packets to come: TXFE lets the driver push the next one */
        s->epin[ep].int_st |= DIEPINT_TXFE;
        dwc2_update_irq(s);
    }
}

/* MMIO */
static uint64_t esp32s3_usb_otg_read(void *opaque, hwaddr addr, unsigned int size)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(opaque);
    uint64_t r = 0;

    /* DFIFO windows: 0x1000 + ep * 0x1000 */
    if (addr >= R_DFIFO0 && addr < R_DFIFO_END) {
        if ((addr % R_DFIFO_STRIDE) == 0) {
            if (addr == R_DFIFO0) {
                r = dwc2_rx_fifo_pop_word(s);
                dwc2_update_irq(s);
                return r;
            }
        }
        return 0;
    }

    switch (addr) {
    case R_GOTGCTL:
        r = s->gotgctl;
        break;
    case R_GOTGINT:
        r = s->gotgint;
        break;
    case R_GAHBCFG:
        r = s->gahbcfg;
        break;
    case R_GUSBCFG:
        r = s->gusbcfg;
        break;
    case R_GRSTCTL:
        r = s->grstctl | GRSTCTL_AHBIDL;
        break;
    case R_GINTSTS:
        r = dwc2_gintsts_effective(s);
        break;
    case R_GINTMSK:
        r = s->gintmsk;
        break;
    case R_GRXSTSR:
        r = dwc2_rxstsp_peek(s);
        break;
    case R_GRXSTSP: {
        uint32_t v = dwc2_rxstsp_peek(s);
        DWC2_DEBUG("dwc2: GRXSTSP pop ep%u bcnt=%u pktsts=%u\n",
                   v & 0xF, (v >> 4) & 0x7FF, (v >> 17) & 0xF);
        dwc2_rxstsp_pop(s);
        r = v;
        dwc2_update_irq(s);
        break;
    }
    case R_GRXFSIZ:
        r = s->grxfsiz;
        break;
    case R_DIEPTXF0:
        r = s->dieptxf[0];
        break;
    case R_GNPTXSTS:
        /* EP0 tx FIFO free space (words); request queue not modeled */
        r = (s->dieptxf[0] >> 16) & 0xFFFFu;
        break;
    case R_GSNPSID:
        r = GSNPSID_VAL;
        break;
    case R_GHWCFG1:
        r = GHWCFG1_VAL;
        break;
    case R_GHWCFG2:
        r = GHWCFG2_VAL;
        break;
    case R_GHWCFG3:
        r = GHWCFG3_VAL;
        break;
    case R_GHWCFG4:
        r = GHWCFG4_VAL;
        break;
    case R_GDFIFOCFG:
        r = s->gdfifocfg;
        break;
    case R_DCFG:
        r = s->dcfg;
        break;
    case R_DCTL:
        r = s->dctl;
        break;
    case R_DSTS:
        /* FS on dedicated 48 MHz PHY (enum speed 3), not suspended */
        r = (3u << 1);
        break;
    case R_DIEPMSK:
        r = s->diepmsk;
        break;
    case R_DOEPMSK:
        r = s->doepmsk;
        break;
    case R_DAINT:
        r = dwc2_daint_derived(s);
        break;
    case R_DAINTMSK:
        r = s->daintmsk;
        break;
    case R_DIEPEMPMSK:
        r = s->diepempmsk;
        break;
    case R_PCGCCTL:
        r = s->pcgcctl;
        break;
    default:
        if (addr >= R_EPIN_BASE
            && addr < R_EPIN_BASE + EP_BLK_SIZE * ESP32S3_USB_EP_COUNT) {
            unsigned ep = (addr - R_EPIN_BASE) / EP_BLK_SIZE;
            unsigned off = (addr - R_EPIN_BASE) % EP_BLK_SIZE;
            switch (off) {
            case EP_OFF_CTL:
                r = s->epin[ep].ctl;
                break;
            case EP_OFF_INT:
                r = s->epin[ep].int_st;
                break;
            case EP_OFF_TSIZ:
                r = s->epin[ep].tsiz;
                break;
            case EP_OFF_DTXFSTS: {
                uint32_t used = (fifo8_num_used(&s->epin[ep].data) + 3u) / 4u;
                r = (s->epin[ep].txf_words > used)
                    ? (s->epin[ep].txf_words - used) : 0;
                break;
            }
            default:
                r = 0;
                break;
            }
        } else if (addr >= R_EPOUT_BASE
                   && addr < R_EPOUT_BASE + EP_BLK_SIZE * ESP32S3_USB_EP_COUNT) {
            unsigned ep = (addr - R_EPOUT_BASE) / EP_BLK_SIZE;
            unsigned off = (addr - R_EPOUT_BASE) % EP_BLK_SIZE;
            switch (off) {
            case EP_OFF_CTL:
                r = s->epout[ep].ctl;
                break;
            case EP_OFF_INT:
                r = s->epout[ep].int_st;
                break;
            case EP_OFF_TSIZ:
                r = s->epout[ep].tsiz;
                break;
            default:
                r = 0;
                break;
            }
        } else {
            qemu_log_mask(LOG_GUEST_ERROR,
                          "dwc2: read from unimplemented offset 0x%04"
                          HWADDR_PRIX "\n", addr);
            r = 0;
        }
        break;
    }

    return r;
}

static void esp32s3_usb_otg_write(void *opaque, hwaddr addr,
                                  uint64_t value, unsigned int size)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(opaque);
    bool pump_out = false;

    /* DFIFO windows */
    if (addr >= R_DFIFO0 && addr < R_DFIFO_END) {
        if ((addr % R_DFIFO_STRIDE) == 0) {
            unsigned ep = (addr - R_DFIFO0) / R_DFIFO_STRIDE;
            if (ep < ESP32S3_USB_EP_COUNT) {
                dwc2_in_fifo_write(s, ep, value);
            }
        }
        return;
    }

    switch (addr) {
    case R_GOTGCTL:
        s->gotgctl = value;
        break;
    case R_GOTGINT:
        s->gotgint &= ~value; /* w1c */
        break;
    case R_GAHBCFG:
        s->gahbcfg = value;
        dwc2_update_irq(s);
        break;
    case R_GUSBCFG:
        s->gusbcfg = value;
        break;
    case R_GRSTCTL:
        if (value & GRSTCTL_CSRST) {
            /* self-clearing core soft reset: drop volatile state */
            unsigned i;
            for (i = 0; i < ESP32S3_USB_EP_COUNT; i++) {
                fifo8_reset(&s->epin[i].data);
                s->epin[i].xfer_left = 0;
                s->epin[i].int_st = 0;
                s->epin[i].tsiz = 0;
                s->epout[i].int_st = 0;
                s->epout[i].tsiz = 0;
            }
            fifo8_reset(&s->grx_fifo);
            s->rxstsp_head = s->rxstsp_tail = 0;
            s->gintsts = 0;
            s->grstctl = 0;
        } else {
            s->grstctl = value & ~(GRSTCTL_RXFFLSH | GRSTCTL_TXFFLSH);
        }
        if (value & GRSTCTL_RXFFLSH) {
            fifo8_reset(&s->grx_fifo);
            s->rxstsp_head = s->rxstsp_tail = 0;
        }
        if (value & GRSTCTL_TXFFLSH) {
            unsigned fnum = (value & GRSTCTL_TXFNUM_MASK) >> GRSTCTL_TXFNUM_SHIFT;
            unsigned i;
            for (i = 0; i < ESP32S3_USB_EP_COUNT; i++) {
                if (fnum == 0x10 || fnum == i) {
                    fifo8_reset(&s->epin[i].data);
                }
            }
        }
        dwc2_update_irq(s);
        break;
    case R_GINTSTS:
        DWC2_DEBUG("dwc2: GINTSTS w1c write %08x (stored=%08x)\n",
                   (unsigned)value, s->gintsts);
        s->gintsts &= ~value; /* w1c (derived bits ignored) */
        dwc2_update_irq(s);
        break;
    case R_GINTMSK:
        s->gintmsk = value;
        dwc2_update_irq(s);
        break;
    case R_GRXFSIZ:
        s->grxfsiz = value & 0xFFFFu;
        break;
    case R_DIEPTXF0:
        s->dieptxf[0] = value;
        s->epin[0].txf_words = (value >> 16) & 0xFFFFu;
        break;
    case R_DCFG:
        s->dcfg = value;
        break;
    case R_DCTL: {
        uint32_t old = s->dctl;
        s->dctl = value;
        if ((old & DCTL_SDIS) && !(value & DCTL_SDIS)) {
            /* soft connect: the virtual host starts the bus */
            DWC2_DEBUG("dwc2: soft connect\n");
            vhost_connect(s);
        } else if (!(old & DCTL_SDIS) && (value & DCTL_SDIS)) {
            DWC2_DEBUG("dwc2: soft disconnect\n");
            vhost_disconnect(s);
        }
        if (value & DCTL_SGONAK) {
            s->gintsts |= GINT_B_GOUTNAKEFF;
        }
        if (value & DCTL_CGONAK) {
            s->gintsts &= ~GINT_B_GOUTNAKEFF;
        }
        dwc2_update_irq(s);
        break;
    }
    case R_DIEPMSK:
        s->diepmsk = value;
        DWC2_DEBUG("dwc2: DIEPMSK = %08x\n", (unsigned)value);
        dwc2_update_irq(s);
        break;
    case R_DOEPMSK:
        s->doepmsk = value;
        dwc2_update_irq(s);
        break;
    case R_DAINTMSK:
        s->daintmsk = value;
        dwc2_update_irq(s);
        break;
    case R_DIEPEMPMSK:
        s->diepempmsk = value;
        DWC2_DEBUG("dwc2: DIEPEMPMSK = %08x\n", (unsigned)value);
        dwc2_update_irq(s);
        break;
    case R_PCGCCTL:
        s->pcgcctl = value;
        break;
    default:
        if (addr == R_DIEPTXF0_N) {
            /* handled below via the range check */
        }
        if (addr >= R_DIEPTXF0_N && addr <= R_DIEPTXF_LAST
            && ((addr - R_DIEPTXF0_N) % 4) == 0) {
            unsigned n = (addr - R_DIEPTXF0_N) / 4;
            unsigned ep = n + 1;

            s->dieptxf[n + 1] = value;
            if (ep < ESP32S3_USB_EP_COUNT) {
                s->epin[ep].txf_words = (value >> 16) & 0xFFFFu;
            }
            break;
        }
        if (addr >= R_EPIN_BASE
            && addr < R_EPIN_BASE + EP_BLK_SIZE * ESP32S3_USB_EP_COUNT) {
            unsigned ep = (addr - R_EPIN_BASE) / EP_BLK_SIZE;
            unsigned off = (addr - R_EPIN_BASE) % EP_BLK_SIZE;
            switch (off) {
            case EP_OFF_CTL:
                s->epin[ep].ctl = value;
                if (ep == 0) {
                    DWC2_DEBUG("dwc2: DIEPCTL0=%08x (tsiz=%u left=%u)\n",
                               (unsigned)value, tsiz_xfer_size(s->epin[0].tsiz),
                               s->epin[0].xfer_left);
                } else {
                    DWC2_DEBUG("dwc2: DIEPCTL%u=%08x (tsiz=%u left=%u)\n",
                               ep, (unsigned)value, tsiz_xfer_size(s->epin[ep].tsiz),
                               s->epin[ep].xfer_left);
                }
                if (value & EPCTL_EPDIS) {
                    /* self-complete the disable */
                    s->epin[ep].int_st |= DIEPINT_EPDISD;
                    s->epin[ep].ctl &= ~EPCTL_EPENA;
                }
                if (value & EPCTL_EPENA) {
                    if (tsiz_xfer_size(s->epin[ep].tsiz) == 0) {
                        /* zero-length IN (e.g. control status): complete now */
                        s->epin[ep].int_st |= DIEPINT_XFRC;
                        s->epin[ep].ctl &= ~EPCTL_EPENA;
                        dwc2_update_irq(s);
                        if (ep == 0) {
                            vhost_on_ep0_in(s, 0);
                        }
                    } else {
                        /*
                         * Real silicon: a freshly-armed TxFIFO starts out
                         * empty, so TXFE fires immediately (same condition
                         * as "FIFO drained below threshold" mid-transfer,
                         * handled below in the DFIFO-write path). Drivers
                         * that are TXFE-interrupt-driven for the push itself
                         * (not just continuation packets) need this initial
                         * kick to ever write the first word — without it the
                         * transfer stays armed forever with no data on the
                         * wire. Mirrors the "more packets to come" TXFE
                         * assert below.
                         */
                        s->epin[ep].int_st |= DIEPINT_TXFE;
                        dwc2_update_irq(s);
                    }
                }
                break;
            case EP_OFF_INT:
                /* w1c, except TXFE which is read-only */
                s->epin[ep].int_st &= ~(value & ~DIEPINT_TXFE);
                dwc2_update_irq(s);
                break;
            case EP_OFF_TSIZ:
                s->epin[ep].tsiz = value;
                s->epin[ep].xfer_left = tsiz_xfer_size(value);
                if (ep == 0) {
                    DWC2_DEBUG("dwc2: DIEPTSIZ0=%08x (left=%u)\n",
                               (unsigned)value, s->epin[0].xfer_left);
                }
                break;
            default:
                break;
            }
        } else if (addr >= R_EPOUT_BASE
                   && addr < R_EPOUT_BASE + EP_BLK_SIZE * ESP32S3_USB_EP_COUNT) {
            unsigned ep = (addr - R_EPOUT_BASE) / EP_BLK_SIZE;
            unsigned off = (addr - R_EPOUT_BASE) % EP_BLK_SIZE;
            switch (off) {
            case EP_OFF_CTL:
                s->epout[ep].ctl = value;
                if (ep != 0) {
                    DWC2_DEBUG("dwc2: DOEPCTL%u=%08x (tsiz=%u pend=%u)\n",
                               ep, (unsigned)value,
                               tsiz_xfer_size(s->epout[ep].tsiz),
                               fifo8_num_used(&s->rx_pending));
                }
                if (value & EPCTL_EPDIS) {
                    s->epout[ep].int_st |= DOEPINT_EPDISD;
                    s->epout[ep].ctl &= ~EPCTL_EPENA;
                }
                dwc2_update_irq(s);
                if (ep == 0) {
                    vhost_on_ep0_out(s);
                }
                pump_out = true;
                break;
            case EP_OFF_INT:
                DWC2_DEBUG("dwc2: DOEPINT%u w1c %08x\n", ep, (unsigned)value);
                s->epout[ep].int_st &= ~value; /* w1c */
                dwc2_update_irq(s);
                break;
            case EP_OFF_TSIZ:
                DWC2_DEBUG("dwc2: DOEPTSIZ%u = %08x\n", ep, (unsigned)value);
                s->epout[ep].tsiz = value;
                if (ep == 0) {
                    vhost_on_ep0_out(s);
                }
                break;
            default:
                break;
            }
        } else {
            qemu_log_mask(LOG_GUEST_ERROR,
                          "dwc2: write to unimplemented offset 0x%04"
                          HWADDR_PRIX " = 0x%08" PRIx64 "\n",
                          (unsigned)addr, value);
        }
        break;
    }

    if (pump_out) {
        dwc2_out_pump(s);
    }
}

/* QOM boilerplate */
static const MemoryRegionOps esp32s3_usb_otg_ops = {
    .read = esp32s3_usb_otg_read,
    .write = esp32s3_usb_otg_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void esp32s3_usb_otg_reset_hold(Object *obj, ResetType type)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(obj);
    unsigned i;

    s->gotgctl = 0;
    s->gotgint = 0;
    s->gahbcfg = 0;
    s->gusbcfg = 0;
    s->grstctl = 0;
    s->gintsts = 0;
    s->gintmsk = 0;
    s->grxfsiz = 0;
    s->gdfifocfg = 0;
    s->dcfg = 0;
    s->dctl = DCTL_SDIS; /* disconnected until the guest soft-connects */
    s->diepmsk = 0;
    s->doepmsk = 0;
    s->daintmsk = 0;
    s->diepempmsk = 0;
    s->pcgcctl = 0;

    for (i = 0; i < ESP32S3_USB_EP_COUNT; i++) {
        fifo8_reset(&s->epin[i].data);
        s->epin[i].ctl = 0;
        s->epin[i].int_st = 0;
        s->epin[i].tsiz = 0;
        s->epin[i].txf_words = 0;
        s->epin[i].xfer_left = 0;
        s->epout[i].ctl = 0;
        s->epout[i].int_st = 0;
        s->epout[i].tsiz = 0;
    }
    fifo8_reset(&s->grx_fifo);
    fifo8_reset(&s->rx_pending);
    fifo8_reset(&s->tx_ch_fifo);
    s->rxstsp_head = s->rxstsp_tail = 0;

    s->vhost = VHOST_DISCONNECTED;
    s->vhost_phase = VPH_SETUP_SENT;
    s->vhost_seq = 0;
    s->vhost_wlength = 0;
    s->vhost_in_count = 0;
    s->vhost_cfg_total = 0;
    s->vhost_stalled = false;
    s->vhost_dev_iman = 0;
    s->vhost_dev_iprod = 0;
    s->vhost_dev_iser = 0;

    qemu_set_irq(s->irq, 0);
}

static void esp32s3_usb_otg_realize(DeviceState *dev, Error **errp)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(dev);

    qemu_chr_fe_set_handlers(&s->chr, dwc2_ch_can_receive, dwc2_ch_receive,
                             dwc2_ch_event, NULL, s, NULL, true);

    /* arm the 1 ms host/frame tick */
    timer_mod(&s->frame_timer,
              qemu_clock_get_ms(QEMU_CLOCK_VIRTUAL) + VHOST_FRAME_PERIOD_MS);
}

static void esp32s3_usb_otg_init(Object *obj)
{
    Esp32s3UsbOtgState *s = ESP32S3_USB_OTG(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    unsigned i;

    memory_region_init_io(&s->iomem, obj, &esp32s3_usb_otg_ops, s,
                          TYPE_ESP32S3_USB_OTG, ESP32S3_USB_OTG_REGS_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);
    sysbus_init_irq(sbd, &s->irq);

    for (i = 0; i < ESP32S3_USB_EP_COUNT; i++) {
        fifo8_create(&s->epin[i].data, 2048);
    }
    fifo8_create(&s->grx_fifo, 2048);
    fifo8_create(&s->rx_pending, 16384);
    fifo8_create(&s->tx_ch_fifo, 16384);

    timer_init_ms(&s->frame_timer, QEMU_CLOCK_VIRTUAL, dwc2_frame_tick, s);
}

static Property esp32s3_usb_otg_properties[] = {
    DEFINE_PROP_CHR("chardev", Esp32s3UsbOtgState, chr),
    DEFINE_PROP_END_OF_LIST(),
};

static void esp32s3_usb_otg_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    rc->phases.hold = esp32s3_usb_otg_reset_hold;
    dc->realize = esp32s3_usb_otg_realize;
    device_class_set_props(dc, esp32s3_usb_otg_properties);
    dc->desc = "ESP32-S3 USB-OTG (DWC2 device mode)";
}

static const TypeInfo esp32s3_usb_otg_info = {
    .name = TYPE_ESP32S3_USB_OTG,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Esp32s3UsbOtgState),
    .instance_init = esp32s3_usb_otg_init,
    .class_init = esp32s3_usb_otg_class_init,
};

static void esp32s3_usb_otg_register_types(void)
{
    type_register_static(&esp32s3_usb_otg_info);
}

type_init(esp32s3_usb_otg_register_types)
